tap "dotenvx/brew"
tap "hashicorp/tap"
tap "tw93/tap"
# Code searching, linting, rewriting
brew "ast-grep"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS Client for Humans
brew "doggo"
# Modern, maintained replacement for ls
brew "eza"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Fast, disk space efficient package manager
brew "pnpm"
# Hook preloader
brew "proxychains-ng"
# Safe, concurrent, practical language
brew "rust"
# Modern Day Portscanner
brew "rustscan"
# Autoformat shell script source code
brew "shfmt"
# Universal proxy platform
brew "sing-box"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Incremental parsing library
brew "tree-sitter"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Terraform
brew "hashicorp/tap/terraform"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Free app that makes your Internet safer
cask "cloudflare-warp"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-monaspice-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Chromium-based web browser
cask "helium-browser"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Tool for multi-language users
cask "input-source-pro"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Free and open-source RSS reader
cask "netnewswire"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
mas "Amphetamine", id: 937984704
mas "Bob", id: 1630034110
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Plain Text Editor", id: 1572202501
mas "Pure Paste", id: 1611378436
mas "RocketSim", id: 1504940162
mas "SnippetsLab", id: 1006087419
mas "Toggl Track", id: 1291898086
mas "Xcode", id: 497799835
vscode "antfu.file-nesting"
vscode "eamodio.gitlens"
vscode "elijah-potter.harper"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-dimmer"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
